module ExBlackHoles where

open import Data.Bool
open import Data.Char renaming (Char to BChar)
open import Data.Empty
open import Data.Fin as Fin
  using (Fin; Fin′; zero; suc; #_; toℕ; _≟_)
open import Data.List as List using (List; []; _∷_)
open import Data.Maybe
open import Data.Nat as ℕ using (suc; ℕ; _∸_; _⊔_)
open import Data.Nat.Show renaming (show to ℕshow)
open import Data.Product using (_×_; _,_; proj₁; proj₂)
open import Data.String as S renaming (_++_ to _+++_)
open import Data.Vec as Vec using (Vec) renaming ([] to []v; _∷_ to _∷v_)
open import Data.Unit

open import ArgPrelude 
open import AIF
open import LabelAlgebras
open import ArgSchemes


la = Pref
-- la = Łuk
-- la = Gödel
import DAG; module DAGla = DAG la; open DAGla

node : ∀ {n} → ANode
             → (v : Float) → {0.0 [≤] v ≡ true} → {v [≤] 1.0 ≡ true}
             → Sucs n
             → AContext n
node nd v {p0} {p1} sucs = context (Ln nd (just (V v {p0} {p1}))) sucs

-- value = nothing
node0 : ∀ {n} → ANode → Sucs n → AContext n
node0 nd sucs = context (Ln nd nothing) sucs


T-хорошо-известно =
  mkFrag "Хорошо известно, что в центре практически каждой крупной галактики находится массивная чёрная дыра."
I-хорошо-известно : ANode
I-хорошо-известно = Lni record
  { sttext = just T-хорошо-известно
  ; stprop = mkProp (Fragment.ftext T-хорошо-известно)
  }

T-в-центре-практически-каждой-крупной-галактики-находится-массивная-чёрная-дыра =
  mkFrag "в центре практически каждой крупной галактики находится массивная чёрная дыра"
I-в-центре-практически-каждой-крупной-галактики-находится-массивная-чёрная-дыра : ANode
I-в-центре-практически-каждой-крупной-галактики-находится-массивная-чёрная-дыра = Lni record
  { sttext = just T-в-центре-практически-каждой-крупной-галактики-находится-массивная-чёрная-дыра
  ; stprop = mkProp (Fragment.ftext T-в-центре-практически-каждой-крупной-галактики-находится-массивная-чёрная-дыра)
  }

T-в-то-же-время-самые-тяжёлые-галактики-окружены-самыми-массивными-гало-из-тёмной-материи =
  mkFrag "В то же время самые тяжёлые галактики окружены самыми массивными гало из тёмной материи."
I-самые-тяжёлые-галактики-окружены-самыми-массивными-гало-из-тёмной-материи : ANode
I-самые-тяжёлые-галактики-окружены-самыми-массивными-гало-из-тёмной-материи = Lni record
  { sttext = just T-в-то-же-время-самые-тяжёлые-галактики-окружены-самыми-массивными-гало-из-тёмной-материи
  ; stprop = mkProp "самые тяжёлые галактики окружены самыми массивными гало из тёмной материи"
  }

T-тёмная-материя-играет-ключевую-роль-в-росте-чёрных-дыр =
  mkFrag "тёмная материя играет ключевую роль в росте чёрных дыр"
I-тёмная-материя-играет-ключевую-роль-в-росте-чёрных-дыр : ANode
I-тёмная-материя-играет-ключевую-роль-в-росте-чёрных-дыр = Lni record
  { sttext = just T-тёмная-материя-играет-ключевую-роль-в-росте-чёрных-дыр
  ; stprop = mkProp (Fragment.ftext T-тёмная-материя-играет-ключевую-роль-в-росте-чёрных-дыр)
  }

T-область-внеземная-физика =  
 mkFrag "Исследования учёных из Института внеземной физики общества Макса Планка, Университетской обсерватории Мюниха и Техасского университета в Остине"
I-область-внеземная-физика : ANode
I-область-внеземная-физика = Lni record
  { sttext = just T-область-внеземная-физика
  ; stprop = mkProp "учёные... --- эксперты во внеземной физике"
  }

T-учёные-из-Института-внеземной-физики  =  
 mkFrag "Исследования учёных из Института внеземной физики общества Макса Планка, Университетской обсерватории Мюниха и Техасского университета в Остине"
I-учёные-из-Института-внеземной-физики : ANode
I-учёные-из-Института-внеземной-физики = Lni record
  { sttext = just T-учёные-из-Института-внеземной-физики
  ; stprop = mkProp "учёные... --- эксперты"
  }

T-такой-прямой-связи-не-существует =
  mkFrag "такой прямой связи не существует"
I-такой-прямой-связи-не-существует : ANode
I-такой-прямой-связи-не-существует = Lni record
  { sttext = just T-такой-прямой-связи-не-существует
  ; stprop = mkProp "не существует прямой связи между..."
  }

T-рост-чёрной-дыры-определяется-процессом-формирования-галактического-ядра =
  mkFrag "рост чёрной дыры определяется процессом формирования галактического ядра"
I-рост-чёрной-дыры-определяется-процессом-формирования-галактического-ядра : ANode
I-рост-чёрной-дыры-определяется-процессом-формирования-галактического-ядра = Lni record
  { sttext = just T-рост-чёрной-дыры-определяется-процессом-формирования-галактического-ядра
  ; stprop = mkProp (Fragment.ftext T-рост-чёрной-дыры-определяется-процессом-формирования-галактического-ядра)
  }

T-учёные-из-Института-внеземной-физики-показали = 
  mkFrag "Исследования учёных из Института внеземной физики общества Макса Планка, Университетской обсерватории Мюниха и Техасского университета в Остине, однако, показали, что такой прямой связи не существует, а рост чёрной дыры определяется процессом формирования галактического ядра."
I-исследования-учёных-показали-что-связи-не-существует : ANode
I-исследования-учёных-показали-что-связи-не-существует = Lni record
  { sttext = just T-учёные-из-Института-внеземной-физики-показали
  ; stprop = mkProp "Исследования показали, что связи нет"
  }
I-исследования-учёных-показали-что-рост-определяется : ANode
I-исследования-учёных-показали-что-рост-определяется = Lni record
  { sttext = just T-учёные-из-Института-внеземной-физики-показали
  ; stprop = mkProp "Исследования показали, что рост ЧД определяется процессом формирования галактического ядра"
  }


SR-от-корреляции-к-причине : ANode
SR-от-корреляции-к-причине = Lnr A-от-корреляции-к-причине
SR-ad-populum : ANode
SR-ad-populum = Lnr A-ad-populum
SR-от-эксперта : ANode
SR-от-эксперта = Lnr A-от-эксперта

SC : ANode
SC = Lnc record {Conflicting = conflicting; Conflicted = conflicted}


G1 : AGraph _
G1 =
     node SC
       0.5 {refl} {refl}
       ((conflicting , # 5) ∷ (conflicted , # 3) ∷ []) &
     node SC
       1.0 {refl} {refl}
       ((conflicting , # 7) ∷ (conflicted , # 1) ∷ []) &
     node SC
       1.0 {refl} {refl}
       ((conflicting , # 0) ∷ (conflicted , # 6) ∷ []) &
     node I-тёмная-материя-играет-ключевую-роль-в-росте-чёрных-дыр
       1.0 {refl} {refl}
       ((причинная-связь , # 0) ∷ []) &
     node SR-от-корреляции-к-причине
       1.0 {refl} {refl}
       ((событие1 , # 9) ∷ (событие2 , # 0) ∷ []) &
     node I-самые-тяжёлые-галактики-окружены-самыми-массивными-гало-из-тёмной-материи
       1.0 {refl} {refl}
       [] &     
     node0 I-такой-прямой-связи-не-существует
       -- 1.0 {refl} {refl}
       ((вывод , # 0) ∷ []) &
     node SR-от-эксперта
       1.0 {refl} {refl}
       ((эксперт , # 5) ∷ (говорит , # 0) ∷ (область , # 4) ∷ []) &
     node I-исследования-учёных-показали-что-связи-не-существует
       1.0 {refl} {refl}
       [] &
     node0 I-рост-чёрной-дыры-определяется-процессом-формирования-галактического-ядра
       -- 1.0 {refl} {refl}
       ((вывод , # 0) ∷ []) &
     node SR-от-эксперта
       1.0 {refl} {refl}
       ((эксперт , # 2) ∷ (говорит , # 0) ∷ (область , # 1) ∷ []) &
     node I-исследования-учёных-показали-что-рост-определяется
       1.0 {refl} {refl}
       [] &
     node I-область-внеземная-физика
       1.0 {refl} {refl}
       [] &
     node I-учёные-из-Института-внеземной-физики
       1.0 {refl} {refl}
       [] &
     node I-в-центре-практически-каждой-крупной-галактики-находится-массивная-чёрная-дыра
       1.0 {refl} {refl}
       ((вывод , # 0) ∷ []) &
     node SR-ad-populum
       1.0 {refl} {refl}
       ((все-признают , # 0) ∷ []) &
     node I-хорошо-известно
       1.0 {refl} {refl}
       [] &
     ∅



G10 = compute G1

G11 = steps 1 G1

G12 = steps 2 G1

G13 = steps 3 G1

G14 = steps 4 G1

G1100 = steps 100 G1





------------------------------------------------------------------------

open import ShowDAG la

open import IO

w = 110
ws = 90 -- "section" title width

printG1 : AGraph 17 → (∀ {n} → AGraph n → Fin n → MC) → String
printG1 g f = "\nI = "    +++ pprint w (f g (# 9))
          +++ " -I = "    +++ pprint w (f g (# 3))
          +++ " Concl = " +++ pprint w (f g (# 1))
          +++ " SR  = "   +++ pprint w (f g (# 2))

main = run (putStrLn stringToPrint)
  where
  wh = 12
  stringToPrint = S.replicate ws '-'
    +++ ppretty ws (docSection ws "G1 orig")
    +++ printG1 G1 val←i
    +++ ppretty ws (docSection ws "G1 computed")
    +++ printG1 G1 val
    +++ ppretty ws (docSection ws "G10")
    +++ printG1 G10 val←i
    +++ ppretty ws (docSection ws "G11")
    +++ printG1 G11 val←i
    +++ ppretty ws (docSection ws "G12")
    +++ printG1 G12 val←i
    +++ ppretty ws (docSection ws "G13")
    +++ printG1 G13 val←i
    +++ ppretty ws (docSection ws "G14")
    +++ printG1 G14 val←i
    +++ ppretty ws (docSection ws "G1100")
    +++ printG1 G1100 val←i

    -- +++ (pprint 110 G1)
